import json
import random
from datetime import timedelta
import datetime
file_path = "DISTRICT_TEMP.json"

district_data = {}
with open(file_path, "r", encoding='UTF-8-sig') as infile:
    district_data = json.load(infile)

area = ['부산', '대구', '인천', '광주', '대전', '울산','세종','경기','강원',
        '충북', '충남', '전북', '전남', '경북', '경남', '제주']

district = {'부산' : ['중구', '서구', '동구', '영도구', '부산진구', '동래구',
                     '남구', '북구', '해운대구', '사하구', '금정구', '강서구',
                     '연제구', '수영구', '사상구', '기장군'],
            '대구' : ['중구', '동구', '서구', '남구', '북구', '수성구', '달서구',
                    '달성군'],
            '인천' : ['중구', '동구', '남구', '미추홀구', '연수구', '남동구', '북구',
                    '부평구', '계양구', '서구', '강화군', '옹진군'],
            '광주' : ['동구', '서구', '남구', '북구', '광산구'],
            '대전' : ['동구', '중구', '서구', '유성구', '대덕구'],
            '울산' : ['중구', '남구', '동구', '북구', '울주군'],
            '세종' : ['세종시'],
            '경기' : ['수원시 장안구', '수원시 권선구', '수원시 팔달구', '수원시 영통구', '성남시 수정구', '성남시 중원구', '성남시 분당구',
                     '의정부시', '안양시 만안구', '안양시 동안구', '부천시 원미구', '부천시 소사구', '부천시 오정구', '광명시', '평택시',
                     '송탄시', '동두천시', '안산시 상록구', '안산시 단원구', '고양시 덕양구', '고양시 일산구', '고양시 일산동구', '고양시 일산서구',
                     '과천시', '구리시', '미금시', '남양주시', '오산시', '시흥시', '군포시', '의왕시', '하남시', '용인시 처인구', '용인시 기흥구',
                     '용신시 수지구', '파주시', '이천시', '안성시', '김포시', '화성시', '광주시', '양주시', '포천시', '여주시'],
            '강원' : ['춘천시', '원주시', '강릉시', '동해시', '태백시', '속초시', '삼척시', '춘천군', '홍천군', '횡성군', '영월군', '평창군', '정선군',
                     '철원군', '화천군', '양구군', '인제군', '고성군', '양양군', '명주군'],
            '충북' : ['청주시 서원구', '청주시 청원구', '청주시 상당구', '청주시 흥덕구', '충주시', '제천시', '청원군', '보은군', '옥천군', '영동군',
                     '증평군', '진천군', '괴산군', '음성군', '중원군', '단양군'],
            '충남' : ['당진시', '천안시 동남구', '천안시 서북구', '공주시', '대천시', '보령시', '온양시', '아산시', '서산시', '논산시', '계룡시', '금산군',
                     '연기군', '공주군', '부여군', '서천군', '청양군', '홍성군', '예산군', '태안군', '당진군'],
            '전북' : ['전주시 완산구', '전주시 덕진구', '군산시', '익산시', '정읍시', '남원시', '김제시', '완주군', '진안군', '무주군', '장수군', '임실군',
                     '순창군', '고창군', '부안군', '김제군', '옥구군'],
            '전남' : ['목포시', '여수시', '순천시', '나주시', '여천시', '동광양시', '광양시', '담양군', '곡성군', '구례군', '승주군', '고흥군', '보성군',
                     '화순군', '장흥군', '강진군', '해남군', '영암군', '무안군', '함평군', '영광군', '장성군', '완도군', '진도군', '신안군'],
            '경북' : ['포항시 남구', '포항시 북구', '경주시', '김천시', '안동시', '구미시', '영주시', '영천시', '상주시', '점촌시', '문경시', '경산시',
                     '달성군', '군위군', '의성군', '청송군', '영양군', '영덕군', '영일군', '경주군', '경산군', '청도군', '고령군', '성주군', '칠곡군',
                     '금릉군', '선산군', '문경군', '예천군', '영풍군', '봉화군', '울진군', '울릉군'],
            '경남' : ['창원시 의창구', '창원시 성산구', '창원시 마산합포구', '창원시 마산회원구', '창원시 진해구', '울산시 합포구', '울산시 회원구', '마산시',
                     '진주시', '진해시', '충무시', '통영시', '삼천포시', '사천시', '김해시', '밀양시', '장승포시', '거제시', '양산시', '진양군', '의령군',
                     '함안군', '창녕군', '고성군', '남해군', '하동군', '산청군', '함양군', '거창군', '합천군'],
            '제주' : ['제주시', '서귀포시', '북제주군', '남제주군']}

start = datetime.datetime(2021,2,26)
count = 0
while(1):
    date = str(start + timedelta(days = count))[:10]
    print(date)
    if date == '2021-12-01': break
    for a in area:
        for d in district[a]:
            district_data['DISTRICT'].append({"AREA": a,
                                              "DISTRICT": d,
                                              "CONFIRMED": random.randrange(0,100),
                                              "DATE": date})
    count += 1

with open('DISTRICT_FINAL.json', 'w', encoding='UTF-8-sig') as outfile:
    json.dump(district_data, outfile, indent=4, ensure_ascii=False)
